summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_regdef.h
/**
 * \file IfxVadc_regdef.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1585 $
 * $Date: 2013-09-03 13:30:24 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Vadc Vadc
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Vadc_Bitfields Bitfields
 * \ingroup IfxLld_Vadc
 * 
 * \defgroup IfxLld_Vadc_union Union
 * \ingroup IfxLld_Vadc
 * 
 * \defgroup IfxLld_Vadc_struct Struct
 * \ingroup IfxLld_Vadc
 * 
 */
#ifndef IFXVADC_REGDEF_H
#define IFXVADC_REGDEF_H
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Vadc_Bitfields
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_VADC_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID x (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID x (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID x (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID x (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID x (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID x (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID x (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID x (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID x (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID x (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID x (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID x (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID x (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID x (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID x (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID x (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID x (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID x (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID x (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID x (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID x (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID x (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID x (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID x (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID x (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID x (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID x (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID x (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID x (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID x (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID x (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID x (rw) */
} Ifx_VADC_ACCEN0_Bits;

/** \\brief  Access Protection Register */
typedef struct _Ifx_VADC_ACCPROT0_Bits
{
    unsigned int APC0:1;                    /**< \brief [0:0] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC1:1;                    /**< \brief [1:1] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC2:1;                    /**< \brief [2:2] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC3:1;                    /**< \brief [3:3] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC4:1;                    /**< \brief [4:4] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC5:1;                    /**< \brief [5:5] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC6:1;                    /**< \brief [6:6] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC7:1;                    /**< \brief [7:7] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC8:1;                    /**< \brief [8:8] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC9:1;                    /**< \brief [9:9] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC10:1;                   /**< \brief [10:10] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC11:1;                   /**< \brief [11:11] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC12:1;                   /**< \brief [12:12] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC13:1;                   /**< \brief [13:13] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APC14:1;                   /**< \brief [14:14] Access Protection Channel Control, Group 0 - 14 (rw) */
    unsigned int APEM:1;                    /**< \brief [15:15] Access Protection External Multiplexer (rw) */
    unsigned int API0:1;                    /**< \brief [16:16] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API1:1;                    /**< \brief [17:17] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API2:1;                    /**< \brief [18:18] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API3:1;                    /**< \brief [19:19] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API4:1;                    /**< \brief [20:20] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API5:1;                    /**< \brief [21:21] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API6:1;                    /**< \brief [22:22] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API7:1;                    /**< \brief [23:23] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API8:1;                    /**< \brief [24:24] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API9:1;                    /**< \brief [25:25] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API10:1;                   /**< \brief [26:26] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API11:1;                   /**< \brief [27:27] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API12:1;                   /**< \brief [28:28] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API13:1;                   /**< \brief [29:29] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int API14:1;                   /**< \brief [30:30] Access Protection Initialization, Group 0 - 14 (rw) */
    unsigned int APGC:1;                    /**< \brief [31:31] Access Protection Global Configuration (rw) */
} Ifx_VADC_ACCPROT0_Bits;

/** \\brief  Access Protection Register */
typedef struct _Ifx_VADC_ACCPROT1_Bits
{
    unsigned int APS0:1;                    /**< \brief [0:0] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS1:1;                    /**< \brief [1:1] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS2:1;                    /**< \brief [2:2] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS3:1;                    /**< \brief [3:3] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS4:1;                    /**< \brief [4:4] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS5:1;                    /**< \brief [5:5] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS6:1;                    /**< \brief [6:6] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS7:1;                    /**< \brief [7:7] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS8:1;                    /**< \brief [8:8] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS9:1;                    /**< \brief [9:9] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS10:1;                   /**< \brief [10:10] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS11:1;                   /**< \brief [11:11] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS12:1;                   /**< \brief [12:12] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS13:1;                   /**< \brief [13:13] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APS14:1;                   /**< \brief [14:14] Access Protection Service Request, Group 0 - 14 (rw) */
    unsigned int APTF:1;                    /**< \brief [15:15] Access Protection Test Function (rw) */
    unsigned int APR0:1;                    /**< \brief [16:16] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR1:1;                    /**< \brief [17:17] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR2:1;                    /**< \brief [18:18] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR3:1;                    /**< \brief [19:19] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR4:1;                    /**< \brief [20:20] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR5:1;                    /**< \brief [21:21] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR6:1;                    /**< \brief [22:22] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR7:1;                    /**< \brief [23:23] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR8:1;                    /**< \brief [24:24] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR9:1;                    /**< \brief [25:25] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR10:1;                   /**< \brief [26:26] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR11:1;                   /**< \brief [27:27] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR12:1;                   /**< \brief [28:28] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR13:1;                   /**< \brief [29:29] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int APR14:1;                   /**< \brief [30:30] Access Protection Result Registers, Group 0 - 14 (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_VADC_ACCPROT1_Bits;

/** \\brief  Background Request Source Control Register */
typedef struct _Ifx_VADC_BRSCTRL_Bits
{
    unsigned int SRCRESREG:4;               /**< \brief [3:0] Source-specific Result Register (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int XTSEL:4;                   /**< \brief [11:8] External Trigger Input Selection (rw) */
    unsigned int XTLVL:1;                   /**< \brief [12:12] External Trigger Level (rh) */
    unsigned int XTMODE:2;                  /**< \brief [14:13] Trigger Operating Mode (rw) */
    unsigned int XTWC:1;                    /**< \brief [15:15] Write Control for Trigger Configuration (w) */
    unsigned int GTSEL:4;                   /**< \brief [19:16] Gate Input Selection (rw) */
    unsigned int GTLVL:1;                   /**< \brief [20:20] Gate Input Level (rh) */
    unsigned int reserved_21:2;             /**< \brief \internal Reserved */
    unsigned int GTWC:1;                    /**< \brief [23:23] Write Control for Gate Configuration (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_VADC_BRSCTRL_Bits;

