summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_regdef.h
/** \\brief  Background Request Source Mode Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_BRSMR_Bits B;
} Ifx_VADC_BRSMR;

/** \\brief  Background Request Source Pending Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_BRSPND_Bits B;
} Ifx_VADC_BRSPND;

/** \\brief  Background Request Source Channel Select Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_BRSSEL_Bits B;
} Ifx_VADC_BRSSEL;

/** \\brief  Group, Channel Ctrl. Reg. */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_CHCTR_Bits B;
} Ifx_VADC_CHCTR;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_CLC_Bits B;
} Ifx_VADC_CLC;

/** \\brief  External Multiplexer Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_EMUXSEL_Bits B;
} Ifx_VADC_EMUXSEL;

/** \\brief  Alias Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_ALIAS_Bits B;
} Ifx_VADC_G_ALIAS;

/** \\brief  Arbitration Configuration Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_ARBCFG_Bits B;
} Ifx_VADC_G_ARBCFG;

/** \\brief  Arbitration Priority Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_ARBPR_Bits B;
} Ifx_VADC_G_ARBPR;

/** \\brief  Autoscan Source Control Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_ASCTRL_Bits B;
} Ifx_VADC_G_ASCTRL;

/** \\brief  Autoscan Source Mode Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_ASMR_Bits B;
} Ifx_VADC_G_ASMR;

/** \\brief  Autoscan Source Pending Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_ASPND_Bits B;
} Ifx_VADC_G_ASPND;

/** \\brief  Autoscan Source Channel Select Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_ASSEL_Bits B;
} Ifx_VADC_G_ASSEL;

/** \\brief  Boundary Flag Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_BFL_Bits B;
} Ifx_VADC_G_BFL;

/** \\brief  Boundary Flag Control Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_BFLC_Bits B;
} Ifx_VADC_G_BFLC;

/** \\brief  Boundary Flag Node Pointer Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_BFLNP_Bits B;
} Ifx_VADC_G_BFLNP;

/** \\brief  Boundary Flag Software Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_BFLS_Bits B;
} Ifx_VADC_G_BFLS;

/** \\brief  Boundary Select Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_BOUND_Bits B;
} Ifx_VADC_G_BOUND;

/** \\brief  Channel Event Flag Clear Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_CEFCLR_Bits B;
} Ifx_VADC_G_CEFCLR;

/** \\brief  Channel Event Flag Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_CEFLAG_Bits B;
} Ifx_VADC_G_CEFLAG;

/** \\brief  Channel Event Node Pointer Register 0, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_CEVNP0_Bits B;
} Ifx_VADC_G_CEVNP0;

/** \\brief  Channel Event Node Pointer Register 1, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_CEVNP1_Bits B;
} Ifx_VADC_G_CEVNP1;

/** \\brief  Channel Assignment Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_CHASS_Bits B;
} Ifx_VADC_G_CHASS;

/** \\brief  External Multiplexer Control Register, Group x */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_EMUXCTR_Bits B;
} Ifx_VADC_G_EMUXCTR;

/** \\brief  Queue 0 Register 0, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_Q0R0_Bits B;
} Ifx_VADC_G_Q0R0;

/** \\brief  Queue 0 Backup Register, Group
 * Queue 0 Input Register, Group
 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access: Queue 0 Backup Register, Group  */
    Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits B_QBUR0;
    /** \brief Bitfield access: Queue 0 Input Register, Group  */
    Ifx_VADC_G_QBUR_QINR0_QINR0_Bits B_QINR0;
} Ifx_VADC_G_QBUR_QINR0;

/** \\brief  Queue 0 Source Control Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_QCTRL0_Bits B;
} Ifx_VADC_G_QCTRL0;

/** \\brief  Queue 0 Mode Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_QMR0_Bits B;
} Ifx_VADC_G_QMR0;

/** \\brief  Queue 0 Status Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_QSR0_Bits B;
} Ifx_VADC_G_QSR0;

/** \\brief  Result Event Flag Clear Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_REFCLR_Bits B;
} Ifx_VADC_G_REFCLR;

/** \\brief  Result Event Flag Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_REFLAG_Bits B;
} Ifx_VADC_G_REFLAG;

/** \\brief  Result Event Node Pointer Register 0, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_REVNP0_Bits B;
} Ifx_VADC_G_REVNP0;

/** \\brief  Result Event Node Pointer Register 1, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_REVNP1_Bits B;
} Ifx_VADC_G_REVNP1;

/** \\brief  Result Assignment Register, Group */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_G_RRASS_Bits B;
} Ifx_VADC_G_RRASS;

